{
    "Title": "Into the Woods",
    "Credits": "Created by Em Ishida (eishida@ucsc.edu) with code from Adam Smith (amsmith@ucsc.edu).",
    "InitialLocation": "Home",
    "Locations": {
        "Home": {
            "Body": "Growing up, you could never escape hearing haunting tales of the darkness that plagues the forest beside your house. You have long since know that the woods are a dangerous place, yet today you have been tasked with delivering Mother's freshly baked bread to Granny. The hot summer sun hangs heavy above you, and you only have one choice: to set out on your journey.",
            "Choices": [
                {
                    "Text": "Head into the woods",
                    "Target": "Head into the woods"
                }
            ]
        },
        "Head into the woods": { 
            "Body": "You follow the serpentine path carving out a small road through the dense trees around you. Sunlight dances through the canopy above your head, dappling the earth below your feet. Birds chirp quietly in the distance, hiding out of sight amongst the rustling leaves. Out of the corner of your eye, you catch sight of a shadow darting past you.",
            "Choices": [
                {
                    "Text": "Continue onwards",
                    "Target": "Continue onwards"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate",
                    "Target": "Investigate the shadow"
                }
            ]
        },
        "Investigate the shadow": { 
            "Body": "Just a rabbit.",
            "Choices": [
                {
                    "Text": "Continue onwards",
                    "Target": "Continue onwards"
                }
            ]
        },
        "Continue onwards": {
            "Body": "As you push farther into the woods, twisted roots begin to sprout from the ground like gnarled fingers grasping upwards towards your feet. The foliage above your head grows thicker, and the atmosphere is growing dimmer. A strange whispering seems to follow you no matter where you go. Peering through the darkness, a faint light appears to blink at you.",
            "Choices": [
                {
                    "Text": "Keep moving forwards",
                    "Target": "Keep moving forwards"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate",
                    "Target": "Investigate the light"
                }
            ]
        },
        "Investigate the light": { 
            "Body": "As you walk towards the light, you soon realize that it's a decrepit cabin that has long since been abandoned. Glass litters the floor from the shattered windows, and the old, weathered walls are marred by deep claw marks. The moment you reach the door, the light is suddenly snuffed out, and you are plunged into near complete darkness, with only the last rays of the sun remaining to guide you back to the path.",
            "Choices": [
                {
                    "Text": "Keep moving forwards",
                    "Target": "Keep moving forwards"
                }
            ]
        },
        "Keep moving forwards": {
            "Body": "The woods are overtaken with an eerie transformation as you press forwards, and the shadows from the trees grow long and sinister, their branches sprawling above your head as if they are caging you in. The scent of damp earth and decaying leaves hangs heavy within the air, mixed in with the scent of something vaguely metallic - blood. Glancing to the side, you notice a crimson trail leading off the side of the path. It looks fresh.",
            "Choices": [
                {
                    "Text": "Approach the end",
                    "Target": "Approach the end"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate",
                    "Target": "Investigate the blood"
                }
            ]
        },
        "Investigate the blood": { 
            "Body": "Following the trail, you stumble across a small clearing. The smell of rot hits you first, before you discover the figure of human, lying mangled on the ground. A hunter, it appears, yet they seem to have been bested by the very prey they had been tracking. Off to the side, their supply pack lies discarded, their belongings having scattered everywhere during the fray that took place. You suppose they won't been needing them anymore.",
            "Choices": [
                {
                    "Text": "Turn back to the path",
                    "Target": "Approach the end"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate further",
                    "Target": "Investigate the pack"
                }
            ]
        },
        "Investigate the pack": { 
            "Body": "Littered amongst the contents strewn across the ground you find some bland food rations and an old rusty knife, hidden within a pocket of the pack. Peering closer at the hunter's body, you notice huge gashes lining the flesh. Whichever creature did this should be avoided at all costs.", 
            "Choices": [
                {
                    "Text": "Turn back to the path",
                    "Target": "Approach the end"
                },
                {
                    "Text": "Pick up the discarded supplies",
                    "Target": "Pick up the discarded supplies"
                }
            ]
        },
        "Pick up the discarded supplies": { 
            "Body": "You stash the food rations and rusty knife within your basket.", 
            "Choices": [
                {
                    "Text": "Approach the end",
                    "Target": "Approach the end"
                }
            ]
        },
        "Approach the end": {
            "Body": "Finally, you can see the light of Granny's house at the very end of the path, signaling a reprieve from the dark forest surrounding you. And yet, you cannot help to feel like something is off. A sense of foreboding hangs within the air, and all noise seems to fade away as you approach, leaving only an eerie silence.",
            "Choices": [
                {
                    "Text": "Enter Granny's house",
                    "Target": "Enter Granny's house"
                }
            ]
        },
        "Enter Granny's house": {
            "Body": "You knock on the front door, only to be met with no response. Testing the handle, you find that it is already unlocked. Strange, you think. Granny was always overly cautious. Stepping into the house, you emerge into the living room. The warm flame that was always kept alight within the fireplace has been snuffed out. Perhaps Granny is sick and resting within her bed.",
            "Choices": [
                {
                    "Text": "Enter the bedroom",
                    "Target": "Enter the bedroom"
                }
            ]
        },
        "Enter the bedroom": {
            "Body": "The lights are off as you enter the room, but you can barely make out the form of a lone figure lying underneath the sheets of the bed. You suppose it must be Granny, but something is nagging at you, letting you know that something about this all seems off. Perhaps it's the fact that the figure in the bed looks a little too large? Shaking the feeling, you clutch your basket holding the fresh bread. Having some good food would surely help make Granny feel better if she's sick.",
            "Choices": [
                {
                    "Text": "Approach the bedside",
                    "Target": "Approach the bedside"
                }
            ]
        },
        "Approach the bedside": {
            "Body": "As you walk towards the figure lying prone within the bed, it takes a moment for your eyes to adjust to the darkness. Maybe it's just your imagination, but Granny is sure looking awfully furry. Getting closer, your heart suddenly stops in fear. Your dear Granny has been replaced by a monsterous wolf, its gaping maw stained with fresh blood. Its eyes fly open as you approach, and with a howl, it leaps up from under the covers and lunges towards you. Acting upon your survival instincts, you run towards the first location you spot.",
            "Choices": [
                {
                    "Text": "Run to the closet",
                    "Target": "Run to the closet"
                }
            ]
        },
        "Run to the closet": {
            "Body": "Slamming the closet door behind you, you are only just fast enough to avoid having your arm bitten off by the creature. Breathing heavily, you press against the door with all your weight, trying to keep the beast at bay. Its claws tear at the flimsy wood, and you know that the blockade won't last much longer. You wrack your brain, desperately trying to come up with anything that might save you.",
            "Choices": [
                {
                    "Text": "...",
                    "Target": "..."
                }
            ],
            "Locked": [
                {
                    "Text": "Pull out the rusty knife",
                    "Target": "Pull out the rusty knife"
                }
            ]
        },
        "Pull out the rusty knife": {
            "Body": "Remembering the old knife that you had taken from the hunter's corpse, you quickly pull it out from your basket, gripping it tightly within your hand. You're just in time, as only moments later, the wolf rips the door from its hinges, leaving you uncovered and exposed. Gathering your breath, you lunge forwards, driving the knife into the wolf's heart, before throwing yourself out of the way. With a gutteral howl, the wolf rears back, before collapsing prone onto the ground. You have slain the beast. Pulling yourself up from off the floor, you slowly stand, making your way towards the door. It's probably best that you return home now, and let Mother know about Granny's fate.",
            "Choices": [
                {
                    "Text": "Exit the house",
                    "Target": "Exit the house"
                }
            ]
        },
        "Exit the house": {
            "Body": "The walk back home feels rather tame as the adrenaline from earlier leaves your body. You escaped with your life by the skin of your teeth, barely avoiding a fate like that of Granny or the hunter that you found within the woods. The bread in your basket has gone cold by this point, and you suppose you'd better just eat it. After all, Granny sure won't be able to anymore."
        },
        "...": {
            "Body": "You are stuck, unable to move and paralyzed with fear, and there's nothing you can do as the beast tears the door from its hinges. You try to dart out of the way, but the wolf smacks you to the ground with its paw, lunging towards you. It's too late, you realize. Your fate is the same as Granny's."
        }
    }
}