{
    "Title": "Into the Woods",
    "Credits": "Created by Em Ishida (eishida@ucsc.edu) with code from Adam Smith (amsmith@ucsc.edu).",
    "InitialLocation": "Home",
    "Locations": {
        "Home": {
            "Body": "Growing up, you could never escape hearing haunting tales of the darkness that plagues the forest beside your house. You have long since know that the woods are a dangerous place, yet today you have been tasked with delivering Mother's freshly baked bread to Granny. The hot summer sun hangs heavy above you, and you only have one choice: to set out on your journey.",
            "Choices": [
                {
                    "Text": "Head into the woods",
                    "Target": "Head into the woods"
                }
            ]
        },
        "Head into the woods": { 
            "Body": "You follow the serpentine path carving out a small path through the dense trees around you. Sunlight dances through the canopy above your head, dappling the earth below your feet. Birds chirp quietly in the distance, hiding out of sight within the amongst the rustling leaves. Out of the corner of your eye you catch sight of a shadow darting past you.",
            "Choices": [
                {
                    "Text": "Continue onwards",
                    "Target": "Continue onwards"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate",
                    "Target": "Investigate the shadow"
                }
            ]
        },
        "Investigate the shadow": { 
            "Body": "Just a rabbit.",
            "Choices": [
                {
                    "Text": "Continue onwards",
                    "Target": "Continue onwards"
                }
            ]
        },
        "Continue onwards": {
            "Body": "As you push farther into the woods, twisted roots begin to sprout from the ground like gnarled fingers grasping upwards towards your feet. The foliage above your head grows thicker, and the light is growing dimmer. A strange whispering seems to follow you no matter where you go. Peering through the darkness, a faint light appears to blink at you.",
            "Choices": [
                {
                    "Text": "Keep moving forwards",
                    "Target": "Keep moving forwards"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate",
                    "Target": "Investigate the light"
                }
            ]
        },
        "Investigate the light": { 
            "Body": "As you walk towards the light, you soon realize that it's a decrepit cabin that has long since been abandoned. Glass litters the floor from the shattered windows, and the old, weathered walls are marred by deep claw marks. The moment you reach the door, the light is suddenly snuffed out, and you are plunged into near complete darkness, with only the last rays of the sun remaining to guide you back to the path.",
            "Choices": [
                {
                    "Text": "Keep moving forwards",
                    "Target": "Keep moving forwards"
                }
            ]
        },
        "Keep moving forwards": {
            "Body": "The woods are overtaken with an eerie transformation as you press forwards, and the shadows from the trees grow long and sinister, their branches sprawling above your head as if they are caging you in. The scent of damp earth and decaying leaves hangs heavy within the air, mixed in with the scent of something vaguely metallic - blood. Glancing to the side, you notice a crimson trail leading off the side of the path. It looks fresh.",
            "Choices": [
                {
                    "Text": "Approach the end",
                    "Target": "Approach the end"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate",
                    "Target": "Investigate the blood"
                }
            ]
        },
        "Investigate the blood": { 
            "Body": "Following the trail, you stumbling across a small clearing. The smell of rot hits you first, before you discover the figure of human, lying mangled on the ground. A hunter, it appears, yet they seem to have been bested by the very prey they had been tracking. Off to the side, their supply pack lies discarded, their belongings have scattered everywhere during the fray that took place. You suppose they won't been needing them anymore.",
            "Choices": [
                {
                    "Text": "Turn back to the path",
                    "Target": "Approach the end"
                }
            ],
            "Investigation": [
                {
                    "Text": "Investigate further",
                    "Target": "Investigate the pack"
                }
            ]
        },
        "Investigate the pack": { 
            "Body": "Littered amongst the contents strewn across the ground you find some bland food rations, and an old rusty knife, hidden within a pocket of the pack. Peering closer at the hunter's body, you notice huge gashes lining the flesh. Whichever creature did this should be avoided at all costs.", 
            "Choices": [
                {
                    "Text": "Turn back to the path",
                    "Target": "Approach the end"
                },
                {
                    "Text": "Pick up the discarded supplies",
                    "Target": "Pick up the discarded supplies"
                }
            ]
        },
        "Pick up the discarded supplies": { 
            "Body": "You stash the food rations and rusty knife within your basket.", 
            "Choices": [
                {
                    "Text": "Approach the end",
                    "Target": "Approach the end"
                }
            ]
        },
        "Approach the end": {
            "Body": "",
            "Choices": [
                {
                    "Text": "Enter Granny's house",
                    "Target": "Enter Granny's house"
                }
            ]
        },
        "Enter Granny's house": {
            "Body": "",
            "Choices": [
                {
                    "Text": "Enter the bedroom",
                    "Target": "Enter the bedroom"
                }
            ]
        },
        "Enter the bedroom": {
            "Body": "",
            "Choices": [
                {
                    "Text": "Approach the bedside",
                    "Target": "Approach the bedside"
                }
            ]
        },
        "Approach the bedside": {
            "Body": "",
            "Choices": [
                {
                    "Text": "Run to the closet",
                    "Target": "Run to the closet"
                }
            ]
        },
        "Run to the closet": {
            "Body": "",
            "Choices": [
                {
                    "Text": "...",
                    "Target": "..."
                }
            ],
            "Locked": [
                {
                    "Text": "Pull out the rusty knife",
                    "Target": "Pull out the rusty knife"
                }
            ]
        },
        "Pull out the rusty knife": {
            "Body": "",
            "Choices": [
                {
                    "Text": "...",
                    "Target": "..."
                }
            ]
        },
        "Beyond": {
            "Body": ""
        }
    }
}